#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=d3c9390f84761927de57dad8909a6c059da3a2e2]
local_file.tfkey: Refreshing state... [id=15727e972e8d28d4eec7b0bc9bc5c977eb9bf84a]
data.aws_ami.java-ami: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0ede19981aff42471]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0c7b2f7a9946eaf48]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java-ami: Read complete after 1s [id=ami-0e8c96cc9d196d4f2]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0dd9752b214f69914]
aws_security_group.allow_http: Refreshing state... [id=sg-0c1bcec292a8df849]
aws_security_group.elb: Refreshing state... [id=sg-066efdb86e9e5912e]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-074ae51d1beab386a]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-023f9ddae3f8e6261]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-00dcfc0e7993e28d1]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-00f2615412abdd892]
aws_security_group.allow_ssh: Refreshing state... [id=sg-09399eabdc7136426]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0150bb0cecb8c8a9f]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0fa66257c37306cee]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0048116cae4ac0b48]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0033cae8dd3b978e9]
aws_instance.bastion-host: Refreshing state... [id=i-0c7ed0bb12f977272]
aws_launch_template.ec2_config: Refreshing state... [id=lt-0833b2bf5074528d6]
aws_route_table.private_route_table: Refreshing state... [id=rtb-096d5952cefade76b]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-05ffeb0e292958be5]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-09f360d241337e31b]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230130234232944300000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0833b2bf5074528d6"
            name    = "terraform-20230130210153046800000001"
          ~ version = "4" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 4 -> (known after apply)
        id                      = "lt-0833b2bf5074528d6"
      ~ image_id                = "ami-0b9be364be94ebd6f" -> "ami-0e8c96cc9d196d4f2"
      ~ latest_version          = 4 -> (known after apply)
        name                    = "terraform-20230130210153046800000001"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*